<template>
  <div class="step">
    <UiElementsTitle title="Этапы и оплата" />
    <hr />
    <UiElementsStep
      button-title="Анализ и дизайн"
      transition-text="На этом этапе наши специалисты проводят тщательный анализ вашей задачи и вашей отрасли. Мы исследуем конкурентов, выявляем ключевые потребности и цели вашего проекта. Затем наши дизайнеры создают детальные макеты в Figma, которые включают в себя визуальное оформление и адаптивность для компьютеров и мобильных устройств. Оплата за этот этап составляет 40% после утверждения макетов." />
    <hr />
    <UiElementsStep
      button-title="Сборка проекта"
      transition-text="На втором этапе мы переносим утвержденный дизайн на платформу Tilda и начинаем настройку сайта. Здесь внимание уделяется деталям и функциональности. Ваш сайт уже на 80% готов. Оплата за этот этап составляет 40% после успешной настройки." />
    <hr />
    <UiElementsStep
      button-title="Техническая реализация и завершение"
      transition-text="На заключительном этапе мы проводим техническую реализацию проекта. Мы заполняем каталог, подключаем домен, выполняем SEO-оптимизацию для улучшения видимости вашего сайта в поисковых системах. Также мы интегрируем инструменты, такие как Яндекс.Вебмастер и Google Search Console. По завершению этого этапа, 20% оплаты должны быть проведены." />
    <hr />
    <UiElementsStep
      button-title="Гарантия и поддержка"
      transition-text="После успешной передачи проекта нашей студии, вы получаете 24 месяца гарантийного обслуживания. Это означает, что мы останемся на связи и готовы решать любые технические проблемы, возникающие в течение года. Наша цель - обеспечить надежное функционирование вашего сайта и вашего бизнеса." />
    <hr />
  </div>
</template>

<style lang="scss" scoped>
.step {
  padding-top: 120px;
}
</style>
